$('path').hover(function(e) {
  $('path').css('fill', '#fff');
  $('.indicator').html('');

  if ($(this).attr('name')) {
    var name = $(this).attr('name'); // получаем название области, города
    var population = $(this).attr('data-population'); // получаем численность населения

    $('<div>' + name + '</div>').appendTo('.indicator'); // отображаем название области, города
    $('<div>Численность населения: ' + population + '</div>').appendTo('.indicator'); // отображаем численность населения
  }

  $('.change').remove();

  var script = document.createElement('script');
  document.body.appendChild(script);

  $(this).css('fill', '#B9CDEE');
  $('path').not(this).css('fill', '#eaeaf4');
  $('.indicator').css({'top': e.pageY - $('.container').offset().top, 'left': e.pageX - $('.container').offset().left + 8}).show(); // устанавливаем позицию и отображаем элемент с классом "indicator" рядом с курсором мыши.
}, function() {
  $('.indicator').html('');
  $('.indicator').hide();
  $('path').css('fill', '#eaeaf4');
});

  
  
var idAarr = ["RU-MOW", "RU-SPE", "RU-NEN", "RU-YAR", "RU-CHE", "RU-ULY", "RU-TYU", "RU-TUL", "RU-SVE", "RU-RYA", "RU-ORL", "RU-OMS", "RU-NGR", "RU-LIP", "RU-KRS", "RU-KGN", "RU-KGD", "RU-IVA", "RU-BRY", "RU-AST", "RU-KHA", "RU-CE", "RU-UD", "RU-SE", "RU-MO", "RU-KR", "RU-KL", "RU-IN", "RU-AL", "RU-BA", "RU-AD", "RU-CR", "RU-SEV", "RU-KO", "RU-KIR", "RU-PNZ", "RU-TAM", "RU-MUR", "RU-LEN", "RU-VLG", "RU-KOS", "RU-PSK", "RU-ARK", "RU-YAN", "RU-CHU", "RU-YEV", "RU-TY", "RU-SAK", "RU-AMU", "RU-BU", "RU-KK", "RU-KEM", "RU-NVS", "RU-ALT", "RU-DA", "RU-STA", "RU-KB", "RU-KC", "RU-KDA", "RU-ROS", "RU-SAM", "RU-TA", "RU-ME", "RU-CU", "RU-NIZ", "RU-VLA", "RU-MOS", "RU-KLU", "RU-BEL", "RU-ZAB", "RU-PRI", "RU-KAM", "RU-MAG", "RU-SA", "RU-KYA", "RU-ORE", "RU-SAR", "RU-VGG", "RU-VOR", "RU-SMO", "RU-TVE", "RU-PER", "RU-KHM", "RU-TOM", "RU-IRK"];
var populationData = [
  ["RU-MOS",  "Московская область", "8 591 736"],
  ["RU-MOW",  "Москва", "13 104 177"],
  ["RU-CHE", "Челябинская область", "3 407 145"],
  ["RU-ORL",  "Орловская область", "700 276"],
  ["RU-OMS",  "Омская область", "1 831 881"],
  ["RU-LIP",  "Липецкая область", "1 126 263"],
  ["RU-KRS",  "Курская область", "1 067 034"],
  ["RU-RYA",  "Рязанская область", "1 088 918"],
  ["RU-BRY",  "Брянская область", "1 152 505"],
  ["RU-KIR",  "Кировская область", "1 138 112"],
  ["RU-ARK",  "Архангельская область", "964 131"],
  ["RU-MUR",  "Мурманская область", "658 698"],
  ["RU-SPE",  "Санкт-Петербург", "5 598 486 "],
  ["RU-YAR",  "Ярославская область", "1 194 605"],
  ["RU-ULY",  "Ульяновская область", "1 181 006"],
  ["RU-NVS",  "Новосибирская область", "2 794 266"],
  ["RU-TYU",  "Тюменская область", "3 851 234"],
  ["RU-SVE",  "Свердловская область", "4 239 161"],
  ["RU-NGR",  "Новгородская область", "575 926"],
  ["RU-KGN",  "Курганская область", "761 586"],
  ["RU-KGD",  "Калининградская область", "1 032 343"],
  ["RU-IVA",  "Ивановская область", "914 493"],
  ["RU-AST",  "Астраханская область", "950 557 "],
  ["RU-KHA",  "Хабаровский край", "1 284 090"],
  ["RU-CE",  "Чеченская республика", "1 508 294"],
  ["RU-UD",  "Удмуртская республика", "1442,3"],
  ["RU-SE",  "Республика Северная Осетия", "687 357"],
  ["RU-MO",  "Республика Мордовия", "771 37"],
  ["RU-KR",  "Республика  Карелия", "527 880"],
  ["RU-KL",  "Республика  Калмыкия", "264 483"],
  ["RU-IN",  "Республика  Ингушетия", "519 078"],
  ["RU-AL",  "Республика Алтай", "210 769"],
  ["RU-BA",  "Республика Башкортостан", "4 080 684"],
  ["RU-AD",  "Республика Адыгея", "497 985"],
  ["RU-CR",  "Республика Крым", "1 916 805"],
  ["RU-KO",  "Республика Коми", "726 43"],
  ["RU-PNZ",  "Пензенская область", "1 246 609"],
  ["RU-TAM",  "Тамбовская область", "966 250"],
  ["RU-LEN",  "Ленинградская область", "2023,4"],
  ["RU-VLG",  "Вологодская область", "1 128 782"],
  ["RU-KOS",  "Костромская область", "571 900"],
  ["RU-PSK",  "Псковская область", "587 786"],
  ["RU-YAN",  "Ямало-Ненецкий АО", "512 387"],
  ["RU-CHU",  "Чукотский АО", "47 840"],
  ["RU-YEV",  "Еврейская автономская область", "147 458"],
  ["RU-TY",  "Республика Тыва", "327 383"],
  ["RU-SAK",  "Сахалинская область", "460 535"],
  ["RU-AMU",  "Амурская область", "756 198"],
  ["RU-BU",  "Республика Бурятия", "974 628"],
  ["RU-KK",  "Республика Хакасия", "530 233"],
  ["RU-KEM",  "Кемеровская область", "2 568 238"],
  ["RU-ALT",  "Алтайский край", "2 130 950"],
  ["RU-DA",  "Республика Дагестан", "3 209 781"],
  ["RU-KB",  "Кабардино-Балкарская республика", "903 266"],
  ["RU-KC",  "Карачаевая-Черкесская республика", "468 300"],
  ["RU-KDA",  "Краснодарский край", "5 819 345"],
  ["RU-ROS",  "Ростовская область", "4 164 500"],
  ["RU-SAM",  "Самарская область", "3 142 000"],
  ["RU-TA",  "Республика Татарстан", "4 001 625"],
  ["RU-ME",  "Республика Марий Эл", "672 321"],
  ["RU-CU",  "Чувашская республика", "1 173 200 "],
  ["RU-NIZ",  "Нижегородская область", "3 081 817"],
  ["RU-VLA",  "Владимирская область", "1 325 510"],
  ["RU-KLU",  "Калужская область", "1 070 853"],
  ["RU-BEL",  "Белгородская область", "1 514 527"],
  ["RU-ZAB",  "Забайкальский край", "992 429"],
  ["RU-PRI",  "Приморский край", "1 820 076"],
  ["RU-KAM",  "Камчатский край", "288 700"],
  ["RU-MAG",  "Магаданская область", "134 315"],
  ["RU-SA",  "Республика Саха (Якутия)", "997 565"],
  ["RU-KYA",  "Красноярский край", "2 845 545"],
  ["RU-ORE",  "Оренбургская область", "1 841 377"],
  ["RU-SAR",  "Саратовская область", "2 404 198"],
  ["RU-VGG",  "Волгоградская область", "2 468 877"],
  ["RU-SMO",  "Смоленская область", "873 041"],
  ["RU-TVE",  "Тверская область", "1 211 183"],
  ["RU-PER",  "Пермская область", "2 508 352"],
  ["RU-KHM",  "Ханты-Мансийский АО", "1 729 500"],
  ["RU-TOM",  "Томская область", "1 052 106"],
  ["RU-IRK",  "Иркутская область", "2 344 360"],
  ["RU-NEN",  "Ненецкий АО", "41 383"],
  ["RU-STA",  "Ставропольский край", "2 891 204 "],
  ["RU-TUL",  "Тульская область", "1 481 471"],
  ["RU-ISLANDS", "Новосибирские острова", ""]
];
  
$('path').each(function() {
  var regId = $(this).attr('id');
  var name = '';

  for (var j = 0; j < populationData.length; j++) {
    if (regId == populationData[j][0]) {
      name = populationData[j][1];
      var population = populationData[j][2];

      $(this).attr('name', name);
      $(this).attr('data-population', population); // численность населения
    }
  }

  var regIdDiv = '<div class="reg">' + '[' + '<span>' + regId + '</span>' + ']' + ' ' + name + '</div>'
  $(regIdDiv).appendTo('.regs');
});

  
  
$('.reg').hover(function() {
  var id = $(this).find('span').text();
  
  idHover = '#' + id;
  
  $(idHover).css('fill','#f6e72d');
  
  },function(){
    $('.indicator').html('');
    $('.indicator').hide();
    $('path').css('fill','rgba(0,0,0,0.2)');
});
